#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.ecs_ssm_sops.data.sops_file.sops_secret: Reading...
module.ecs_ssm_sops.data.sops_file.sops_secret: Read complete after 0s [id=-]
module.ecs_r53.data.aws_route53_zone.public: Reading...
module.ecr.aws_ecr_repository.main: Refreshing state... [id=travelapp-ecr]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-07370bdafa53b8c4f]
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_USERNAME"]: Refreshing state... [id=DB_USERNAME]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:378842471989:cluster/travelapp-cluster]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Reading...
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Reading...
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_HOSTNAME"]: Refreshing state... [id=DB_HOSTNAME]
module.ecs_ssm_sops.aws_ssm_parameter.main["DB_PASSWORD"]: Refreshing state... [id=DB_PASSWORD]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.custom: Read complete after 0s [id=3750463013]
module.ecs_taskdef_travelapp.data.aws_iam_policy_document.main: Read complete after 0s [id=1077804475]
module.ecs_taskdef_travelapp.aws_iam_policy.main: Refreshing state... [id=arn:aws:iam::378842471989:policy/ECS-Allow-All]
module.ecs_taskdef_travelapp.aws_iam_role.main: Refreshing state... [id=ECS-TravelApp-Role]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.example: Refreshing state... [id=travelapp-cluster]
module.ecs_taskdef_travelapp.aws_iam_role_policy_attachment.main: Refreshing state... [id=ECS-TravelApp-Role-20231214174657259600000001]
module.ecs_taskdef_travelapp.aws_ecs_task_definition.main: Refreshing state... [id=travelapp-taskdefintion]
module.ecs_r53.data.aws_route53_zone.public: Read complete after 1s [id=Z00595491K8FFQ0O1DVA]
module.vpc.aws_route_table.main: Refreshing state... [id=rtb-0299c90bb8997687c]
module.vpc.aws_subnet.public_subnets[1]: Refreshing state... [id=subnet-0299bc63a7ad5223e]
module.vpc.aws_subnet.public_subnets[0]: Refreshing state... [id=subnet-01a9331b22ab97a18]
module.vpc.aws_internet_gateway.main[0]: Refreshing state... [id=igw-03ab51c457fad06d3]
module.ecs_alb.aws_alb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:targetgroup/travelapp-tg/844a1f46403d72c8]
module.rds_public_sg.aws_security_group.main: Refreshing state... [id=sg-079b9b8919dff4d83]
module.public_sg.aws_security_group.main: Refreshing state... [id=sg-0feda0c9e5bab127f]
module.vpc.aws_route.igw_route[0]: Refreshing state... [id=r-rtb-0299c90bb8997687c1080289494]
module.vpc.aws_route_table_association.public_subnets_route_association[1]: Refreshing state... [id=rtbassoc-08029f31cc5f59667]
module.vpc.aws_route_table_association.public_subnets_route_association[0]: Refreshing state... [id=rtbassoc-064ff63696fb58293]
module.ecs_alb.aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:378842471989:loadbalancer/app/travelapp-alb/2f4b768b535866ea]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecs_r53.aws_route53_record.main will be created
  + resource "aws_route53_record" "main" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "travelapp.bernatei.com"
      + type            = "A"
      + zone_id         = "Z00595491K8FFQ0O1DVA"

      + alias {
          + evaluate_target_health = false
          + name                   = "travelapp-alb-976639324.us-east-1.elb.amazonaws.com"
          + zone_id                = "Z35SXDOTRQ7X7K"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @bertei, Action: `pull_request`*